package kafkatohive.source

object Data {
  val firstnames: Array[String] = Array(
    "Алексей",
    "Александр",
    "Иван",
    "Кирилл",
    "Ярослав",
    "Арсений",
    "Артём",
    "Тихон",
    "Георгий",
    "Виктор",
    "Тимур",
    "Дмитрий",
    "Андрей",
    "Максим",
    "Лев",
    "Сергей",
    "Святослав",
    "Владимир",
    "Антон",
    "Евгений"
  )
  val lastnames: Array[String] = Array(
    "Булатов",
    "Васильев",
    "Головин",
    "Ефимов",
    "Ильин",
    "Колесников",
    "Коротков",
    "Кочетков",
    "Макаров",
    "Митрофанов",
    "Назаров",
    "Окулов",
    "Панов",
    "Попов",
    "Романов",
    "Рыбаков",
    "Сергеев",
    "Третьяков",
    "Чернов",
    "Латов"
  )
  val patronymics: Array[String] = Array(
    "Александрович",
    "Дмитриевич",
    "Леонидович",
    "Георгиевич",
    "Никитич",
    "Михайлович",
    "Олегович",
    "Матвеевич",
    "Максимович",
    "Тимофеевич",
    "Дмитриевич",
    "Иванович",
    "Артёмович",
    "Адамович",
    "Святославович"
  )
  val cities: Array[String] = Array(
    "Москва",
    "Санкт-Петербург",
    "Воронеж",
    "Казань",
    "Калининград",
    "Курск",
    "Ростов-на-Дону",
    "Липецк"
  )
  val codes: Array[String] = Array(
    "MSK",
    "SPB",
    "VRN",
    "KZN",
    "KNG",
    "KRS",
    "RND",
    "LPK"
  )
  val streets : Array[String] = Array(
    "Ленина",
    "Депутанская",
    "Московская",
    "Набережная",
    "Гороховка",
    "Новая",
    "Адмирала Ушакова",
    "Центральная"
  )
  val statuses : Array[String] = Array(
    "Жилое",
    "Нежилое",
    "Не определено"
  )
}
